buoyantBoussinesqCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontandback
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11238;
        startFace       10988;
    }
    in1
    {
        type            patch;
        nFaces          24;
        startFace       22226;
    }
    in2
    {
        type            patch;
        nFaces          29;
        startFace       22250;
    }
    out
    {
        type            patch;
        nFaces          24;
        startFace       22279;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          423;
        startFace       22303;
    }
)

// ************************************************************************* //
