buoyantBoussinesqCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    in1
    {
        type           fixedValue;
        value           uniform (1 0 0);
    }

    in2
    {
        type           fixedValue;
        value           uniform (0 2 0);
    }

    out
    {
        type           zeroGradient;
    }
    
    walls
    {
        type           fixedValue;
        value           uniform (0 0 0);
    }

    frontandback
    {
        type           empty;
    }
}


// ************************************************************************* //
