buoyantBoussinesqCase/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    in1
    {
        type           zeroGradient;
    }

    in2
    {
        type           zeroGradient;
    }

    out
    {
        type           fixedValue;
        value           uniform 0;
    }
    
    walls
    {
        type           zeroGradient;
    }

    frontandback
    {
        type           empty;
    }
}


// ************************************************************************* //
