buoyantBoussinesqCase/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    in1
    {
        type		turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.014;
        value           $internalField;
    }

    in2
    {
        type		turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.014;
        value           $internalField;
    }

    out
    {
        type            zeroGradient;
    }
    
    walls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    frontandback
    {
        type           empty;
    }
}


// ************************************************************************* //
